# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
list=[2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97 ]
number=int(input('введите натуральное число от 1 до 100'))
while number>1:
    for i in range(len(list)):
        if number%list[i]==0:
            print(list[i])
            number=number/list[i]